tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_slcd.h
/**
  * @brief SLCD_DR5 Register Bit Definition
  */
#define  SLCD_DR5_SLCD_DR5_Pos                    (0)
#define  SLCD_DR5_SLCD_DR5_Msk                    (0xFFFFFFFFU << SLCD_DR5_SLCD_DR5_Pos)            /*!<High 32 bit display data corresponding to COM2*/

/**
  * @brief SLCD_DR6 Register Bit Definition
  */
#define  SLCD_DR6_SLCD_DR6_Pos                    (0)
#define  SLCD_DR6_SLCD_DR6_Msk                    (0xFFFFFFFFU << SLCD_DR6_SLCD_DR6_Pos)            /*!<Low 32 bit display data corresponding to COM3*/

/**
  * @brief SLCD_DR7 Register Bit Definition
  */
#define  SLCD_DR7_SLCD_DR7_Pos                    (0)
#define  SLCD_DR7_SLCD_DR7_Msk                    (0xFFFFFFFFU << SLCD_DR7_SLCD_DR7_Pos)            /*!<High 32 bit display data corresponding to COM3*/

/**
  * @brief SLCD_DR8 Register Bit Definition
  */
#define  SLCD_DR8_SLCD_DR8_Pos                    (0)
#define  SLCD_DR8_SLCD_DR8_Msk                    (0xFFFFFFFFU << SLCD_DR8_SLCD_DR8_Pos)            /*!<Low 32 bit display data corresponding to COM4*/

/**
  * @brief SLCD_DR9 Register Bit Definition
  */
#define  SLCD_DR9_SLCD_DR9_Pos                    (0)
#define  SLCD_DR9_SLCD_DR9_Msk                    (0xFFFFFFFFU << SLCD_DR9_SLCD_DR9_Pos)            /*!<High 32 bit display data corresponding to COM4*/

/**
  * @brief SLCD_DR10 Register Bit Definition
  */
#define  SLCD_DR10_SLCD_DR10_Pos                  (0)
#define  SLCD_DR10_SLCD_DR10_Msk                  (0xFFFFFFFFU << SLCD_DR10_SLCD_DR10_Pos)          /*!<Low 32 bit display data corresponding to COM5*/

/**
  * @brief SLCD_DR11 Register Bit Definition
  */
#define  SLCD_DR11_SLCD_DR11_Pos                  (0)
#define  SLCD_DR11_SLCD_DR11_Msk                  (0xFFFFFFFFU << SLCD_DR11_SLCD_DR11_Pos)          /*!<High 32 bit display data corresponding to COM5*/

/**
  * @brief SLCD_DR12 Register Bit Definition
  */
#define  SLCD_DR12_SLCD_DR12_Pos                  (0)
#define  SLCD_DR12_SLCD_DR12_Msk                  (0xFFFFFFFFU << SLCD_DR12_SLCD_DR12_Pos)          /*!<Low 32 bit display data corresponding to COM6*/

/**
  * @brief SLCD_DR13 Register Bit Definition
  */
#define  SLCD_DR13_SLCD_DR13_Pos                  (0)
#define  SLCD_DR13_SLCD_DR13_Msk                  (0xFFFFFFFFU << SLCD_DR13_SLCD_DR13_Pos)          /*!<High 32 bit display data corresponding to COM6*/

/**
  * @brief SLCD_DR14 Register Bit Definition
  */
#define  SLCD_DR14_SLCD_DR14_Pos                  (0)
#define  SLCD_DR14_SLCD_DR14_Msk                  (0xFFFFFFFFU << SLCD_DR14_SLCD_DR14_Pos)          /*!<Low 32 bit display data corresponding to COM7*/

/**
  * @brief SLCD_DR15 Register Bit Definition
  */
#define  SLCD_DR15_SLCD_DR15_Pos                  (0)
#define  SLCD_DR15_SLCD_DR15_Msk                  (0xFFFFFFFFU << SLCD_DR15_SLCD_DR15_Pos)          /*!<High 32 bit display data corresponding to COM7*/


#endif

